000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/АктивностьПользователей/АктивностьПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктивностьПользователей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Хеш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ссылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/АктивностьПользователейСервер/Module.bsl
Процедура СделатьЗаписьВРС(Хеш,Текдата,Ссылка,Комментарий) Экспорт
	НомерСеанса = НомерСеансаИнформационнойБазы();
	Рег = РегистрыСведений.АктивностьПользователей.СоздатьМенеджерЗаписи();
	Рег.Период = ТекДата;
	Рег.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Рег.НомерСеанса = НомерСеанса;
	Рег.Хеш = Хеш;
	Рег.Комментарий = Комментарий;
	Рег.Ссылка=Ссылка;
	Рег.Записать(Истина);
КонецПроцедуры
